In [5]:
import pandas as pd
#list of tuples
friends=[
    ('tan','g9',18,'sklm',56)
    ('mammu','k3',22,'rajmandry',48)
    ('aswini','g8',18,'rajam',58)
    ('durgaprasanna','k5',17,'rajam',80)
    ('hema','n8',19,'tirupati',76)
    ('siddu','j9',19,'delhi',55)
]

#creating data frame
jaga = pd.DataFrame(friends,
                columns = ['name','class','age','city','marks'])
jaga

<>:4: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
<>:4: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
C:\Users\KEERTH~1\AppData\Local\Temp/ipykernel_6016/1287610419.py:4: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
  ('tan','g9',18,'sklm',56)

TypeError: 'tuple' object is not callable

In [7]:
import pandas as pd
#list of tuples
friends=[
    ('tan','g9',18,'sklm',56),
    ('mammu','k3',22,'rajmandry',48),
    ('aswini','g8',18,'rajam',58),
    ('durgaprasanna','k5',17,'rajam',80),
    ('hema','n8',19,'tirupati',76),
    ('siddu','j9',19,'delhi',55)
]

#creating data frame
jaga = pd.DataFrame(friends,columns=['name','class','age','city','marks'])

jaga

            name class  age       city  marks
0            tan    g9   18       sklm     56
1          mammu    k3   22  rajmandry     48
2         aswini    g8   18      rajam     58
3  durgaprasanna    k5   17      rajam     80
4           hema    n8   19   tirupati     76
5          siddu    j9   19      delhi     55

In [8]:
pd=jaga.dtypes
pd

name     object
class    object
age       int64
city     object
marks     int64
dtype: object

In [12]:
# GETTING DATA TYPE OF SINGLE COLUM
print(jaga['city'])

# use data frame .dtype to give singe colum:df.dtypes["clo name"]
sa=jaga.dtypes['city']
sa

0         sklm
1    rajmandry
2        rajam
3        rajam
4     tirupati
5        delhi
Name: city, dtype: object

dtype('O')

In [13]:
sa

dtype('O')

In [15]:
print(jaga.dtypes['marks'])

int64

In [19]:
a=jaga.dtypes['name']
a

dtype('O')

In [20]:
#info
#retuns colums,rows of df
# non-null entries in each colm Dtype of col,
#count of cou,names and data types
jaga.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   class   6 non-null      object
 2   age     6 non-null      int64
 3   city    6 non-null      object
 4   marks   6 non-null      int64
dtypes: int64(2), object(3)
memory usage: 368.0+ bytes

In [1]:
# drop all those rows which
# have any 'nan' values in it

jaga.dropna(inplace=True)

NameError: name 'jaga' is not defined

In [9]:
import pandas as pd
#list of tuples
friends=[
    ('tan','g9',18,'sklm',56),
    ('mammu','k3',22,'rajmandry',48),
    ('aswini','g8',18,'rajam',58),
    ('durgaprasanna','k5',17,'rajam',80),
    ('hema','n8',19,'tirupati',76),
    ('siddu','j9',19,'delhi',55),
    ('gopi',' ',12,'dosari',65)
]

#creating data frame
jaga = pd.DataFrame(friends,columns=['name','class','age','city','marks'])

jaga

            name class  age       city  marks
0            tan    g9   18       sklm     56
1          mammu    k3   22  rajmandry     48
2         aswini    g8   18      rajam     58
3  durgaprasanna    k5   17      rajam     80
4           hema    n8   19   tirupati     76
5          siddu    j9   19      delhi     55
6           gopi         12     dosari     65

In [10]:
d=jaga.dropna(inplace = True)
d

In [11]:
jaga

            name class  age       city  marks
0            tan    g9   18       sklm     56
1          mammu    k3   22  rajmandry     48
2         aswini    g8   18      rajam     58
3  durgaprasanna    k5   17      rajam     80
4           hema    n8   19   tirupati     76
5          siddu    j9   19      delhi     55
6           gopi         12     dosari     65

In [12]:
d

In [ ]:
# conver marks(int) TO float

In [21]:



marks2=jaga.marks.astype('float64')

#after=jaga.dtypes['marks']
print(jaga.dtypes['marks']

SyntaxError: unexpected EOF while parsing (Temp/ipykernel_8652/1768667764.py, line 8)

In [22]:
sis=jaga.info()
sis

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   class   7 non-null      object
 2   age     7 non-null      int64
 3   city    7 non-null      object
 4   marks   7 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 336.0+ bytes

In [29]:
sis=jaga.age.astype('float64')
sis
print(jaga.dtypes['age'])
print(jaga.dtypes['marks'])
jaga.info()

float64
float64
<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      category
 1   class   7 non-null      object
 2   age     7 non-null      float64
 3   city    7 non-null      object
 4   marks   7 non-null      float64
dtypes: category(1), float64(2), object(2)
memory usage: 643.0+ bytes

In [24]:
print(jaga.dtypes['age'])

int64

In [30]:
#CHANGE MORE THAN ONE COLUM AT ONCE
jaga=jaga.astype({"name":'category','age':'int64'})
jaga.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      category
 1   class   7 non-null      object
 2   age     7 non-null      int64
 3   city    7 non-null      object
 4   marks   7 non-null      float64
dtypes: category(1), float64(1), int64(1), object(2)
memory usage: 643.0+ bytes

In [32]:
chelli=jaga.head(),header=None
chelli

SyntaxError: cannot assign to function call (Temp/ipykernel_8652/1037064035.py, line 1)

In [36]:
import pandas as pd
sa=pd.read_csv("100 Sales Records.csv")
sa

#changing our own header

sa.header(10)

ValueError: Length mismatch: Expected axis has 14 elements, new values have 2 elements

In [35]:
import pandas as pd
mom=pd.read_csv("100 Sales Records.csv",header=None)
mom

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
1,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654,1582243.5,951410.5
2,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.7,117.11,576782.8,328376.44,248406.36
3,Europe,Russia,Office Supplies,Offline,L,05-02-2014,341417157,05-08-2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
4,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,07-05-2014,8102,9.33,6.92,75591.66,56065.84,19525.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,09-03-2011,888,109.28,35.84,97040.64,31825.92,65214.72
97,Asia,Malaysia,Fruits,Offline,L,11-11-2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
98,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,06-01-2016,728815257,6/29/2016,1485,154.06,90.93,228779.1,135031.05,93748.05
99,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,08-08-2015,5767,81.73,56.67,471336.91,326815.89,144521.02
100,Sub-Saharan Africa,Mozambique,Household,Offline,L,02-10-2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [37]:
import pandas as pd
prassu=pd.read_csv("chelli.csv") 
prassu

       name  age  gender  phone
0      jaga   30  female    233
1   keerthi   18  female    630
2  prasanna   17  female    730
3     venky   19  female    427
4    aswini   15  female    908
5      gopi   13    male    574
6     madhu   27    male    345

In [38]:
# creating our own header
du=prassu.columns=['name2','catagiry']
du

ValueError: Length mismatch: Expected axis has 4 elements, new values have 2 elements

In [39]:
# creating our own header
du=prassu.columns=['name2','age2','catagiry','contact_detail']
du

['name2', 'age2', 'catagiry', 'contact_detail']

In [40]:
prassu

      name2  age2 catagiry  contact_detail
0      jaga    30   female             233
1   keerthi    18   female             630
2  prasanna    17   female             730
3     venky    19   female             427
4    aswini    15   female             908
5      gopi    13     male             574
6     madhu    27     male             345